Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/runsc/nginx/target_count_2/repeat_24/1.txt
2020/01/23 21:39:12 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8001/
2020/01/23 21:39:42 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Completed 100000 requests
Finished 102317 requests
Server Software:        nginx/1.17.7
Server Hostname:        192.168.3.100
Server Port:            8001
Document Path:          /
Document Length:        612 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      102317
Failed requests:        0
Total transferred:      86457865 bytes
HTML transferred:       62618004 bytes
Requests per second:    3410.53 [#/sec] (mean)
Time per request:       29.321 [ms] (mean)
Time per request:       0.293 [ms] (mean, across all concurrent requests)
Transfer rate:          2814.36 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       8
Processing:     0   29  58.9      9     218
Waiting:        0   29  58.9      8     217
Total:          1   29  58.9      9     224
Percentage of the requests served within a certain time (ms)
  50%      9
  66%     12
  75%     14
  80%     16
  90%    159
  95%    204
  98%    207
  99%    208
 100%    224 (longest request)
2020/01/23 21:39:42 Matched stat line [Connect:        0    0   0.3      0       8 Connect 0 0 0.3 0 8]
2020/01/23 21:39:42 Matched stat line [Processing:     0   29  58.9      9     218 Processing 0 29 58.9 9 218]
2020/01/23 21:39:42 Matched stat line [Waiting:        0   29  58.9      8     217 Waiting 0 29 58.9 8 217]
2020/01/23 21:39:42 Matched stat line [Total:          1   29  58.9      9     224 Total 1 29 58.9 9 224]
2020/01/23 21:39:42 Matched percentline [  50%      9 50 9]
2020/01/23 21:39:42 Matched percentline [  66%     12 66 12]
2020/01/23 21:39:42 Matched percentline [  75%     14 75 14]
2020/01/23 21:39:42 Matched percentline [  80%     16 80 16]
2020/01/23 21:39:42 Matched percentline [  90%    159 90 159]
2020/01/23 21:39:42 Matched percentline [  95%    204 95 204]
2020/01/23 21:39:42 Matched percentline [  98%    207 98 207]
2020/01/23 21:39:42 Matched percentline [  99%    208 99 208]
2020/01/23 21:39:42 Matched percentline [ 100%    224 100 224]
{"connect":{"max":8,"mean":0,"median":0,"min":0,"stdDev":0.30000001192092896},"percentiles":{"100":224,"50":9,"66":12,"75":14,"80":16,"90":159,"95":204,"98":207,"99":208},"processing":{"max":218,"mean":29,"median":9,"min":0,"stdDev":58.900001525878906},"total":{"max":224,"mean":29,"median":9,"min":1,"stdDev":58.900001525878906},"waiting":{"max":217,"mean":29,"median":8,"min":0,"stdDev":58.900001525878906}}